🚀&nbsp; env0 had composed a PR Plan for environment [Karl / env0-demos blocks / Subnet1 ](https://app.env0.com/p/07e24ae9-65b0-40b8-b360-5a9228323add/environments/9c2aa024-62c9-4136-afec-ae7c51e33a2e?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92):
```
Plan: 1 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:


  # aws_subnet.public will be created
+   resource "aws_subnet" "public" {
+       arn                             = (known after apply)
+       assign_ipv6_address_on_creation = false
+       availability_zone               = "us-west-2a"
+       availability_zone_id            = (known after apply)
+       cidr_block                      = "10.84.1.0/24"
+       id                              = (known after apply)
+       ipv6_cidr_block_association_id  = (known after apply)
+       map_public_ip_on_launch         = true
+       owner_id                        = (known after apply)
+       tags                            = {
+           "Name" = "public-subnet-1a"
        }
+       tags_all                        = {
+           "Name" = "public-subnet-1a"
        }
+       vpc_id                          = "vpc-03b48c1f31ba93987"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
</details>


```
Failed to calculate cost estimation
```


[Full PR Plan logs on env0](https://app.env0.com/p/07e24ae9-65b0-40b8-b360-5a9228323add/environments/9c2aa024-62c9-4136-afec-ae7c51e33a2e/deployments/36f47936-d7ee-439e-86ed-21985f0586fd?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92)

[![env0-ai-summary-banner](https://app.env0.com/images/vcs-comment-ai-summary-banner.png)](https://app.env0.com/p/07e24ae9-65b0-40b8-b360-5a9228323add/environments/9c2aa024-62c9-4136-afec-ae7c51e33a2e/deployments/36f47936-d7ee-439e-86ed-21985f0586fd?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92&ai-analyzer=plan-summary)